In [1]:
import pandas as pd

<h3>Read Data with Python</h3>

In [4]:
file_path = 'Data/btc-market-price.csv'

with open(file_path,'r') as reader:
    print(reader)

<_io.TextIOWrapper name='Data/btc-market-price.csv' mode='r' encoding='cp1252'>

In [6]:
file_path = 'Data/btc-market-price.csv'

with open(file_path,'r') as reader:
    for index, line in enumerate(reader.readlines()):
        if (index<10):
            print(index,line)

0 2/4/17 0:00,1099.169125

1 3/4/17 0:00,1141.813

2 4/4/17 0:00,?

3 5/4/17 0:00,1133.079314

4 6/4/17 0:00,-

5 7/4/17 0:00,-

6 8/4/17 0:00,1181.149838

7 9/4/17 0:00,1208.8005

8 10/4/17 0:00,1207.744875

9 11/4/17 0:00,1226.617038

<h3>Read data with pandas</h3>

In [8]:
df = pd.read_csv('Data/btc-market-price.csv')
df

      2/4/17 0:00  1099.169125
0     3/4/17 0:00     1141.813
1     4/4/17 0:00            ?
2     5/4/17 0:00  1133.079314
3     6/4/17 0:00            -
4     7/4/17 0:00            -
..            ...          ...
359  28/3/18 0:00      7960.38
360  29/3/18 0:00      7172.28
361  30/3/18 0:00  6882.531667
362  31/3/18 0:00      6935.48
363   1/4/18 0:00     6794.105

[364 rows x 2 columns]

<h3>First row behaviour with header parameter</h3>

In [10]:
df = pd.read_csv('Data/btc-market-price.csv' ,header=None)
df

                0            1
0     2/4/17 0:00  1099.169125
1     3/4/17 0:00     1141.813
2     4/4/17 0:00            ?
3     5/4/17 0:00  1133.079314
4     6/4/17 0:00            -
..            ...          ...
360  28/3/18 0:00      7960.38
361  29/3/18 0:00      7172.28
362  30/3/18 0:00  6882.531667
363  31/3/18 0:00      6935.48
364   1/4/18 0:00     6794.105

[365 rows x 2 columns]

<h3>Missing values with na_values parameter</h3>

In [12]:
df = pd.read_csv('Data/btc-market-price.csv' ,header=None ,na_values=['','?','-'])
df.head()

             0            1
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

<h3>Column Names using Name Parameter</h3>

In [13]:
df = pd.read_csv('Data/btc-market-price.csv',
                 header=None,
                 na_values=['','?','-'],
                 names=['Timestamp','Price'])
df.head()

     Timestamp        Price
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

<h3>Column datatypes with dtype parameter</h3>

In [15]:
df = pd.read_csv('Data/btc-market-price.csv',
                 header=None,
                 na_values=['','?','-'],
                 names=['Timestamp','Price'],
                 dtype = {'price':'float'})
df.head()

     Timestamp        Price
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

In [16]:
df.dtypes

Timestamp     object
Price        float64
dtype: object

In [19]:
df['Timestamp'] = pd.to_datetime(df['Timestamp'])
df.head()

   Timestamp        Price
0 2017-02-04  1099.169125
1 2017-03-04  1141.813000
2 2017-04-04          NaN
3 2017-05-04  1133.079314
4 2017-06-04          NaN

In [20]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

<h3>Date Parser Using parse_dates parameter</h3>

In [24]:
df = pd.read_csv('Data/btc-market-price.csv',
                 header=None,
                 na_values=['','?','-'],
                 names=['Timestamp','Price'],
                 dtype = {'price':'float'},
                 parse_dates=[0])
df.head()

   Timestamp        Price
0 2017-02-04  1099.169125
1 2017-03-04  1141.813000
2 2017-04-04          NaN
3 2017-05-04  1133.079314
4 2017-06-04          NaN

In [26]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

<h3>Adding index to our data using index_col parameter</h3>

In [27]:
df = pd.read_csv('Data/btc-market-price.csv',
                 header=None,
                 na_values=['','?','-'],
                 names=['Timestamp','Price'],
                 dtype = {'price':'float'},
                 parse_dates=[0],
                 index_col=[0])
df.head()

                  Price
Timestamp
2017-02-04  1099.169125
2017-03-04  1141.813000
2017-04-04          NaN
2017-05-04  1133.079314
2017-06-04          NaN

In [28]:
df.dtypes

Price    float64
dtype: object

<h3>A more challeging parsing</h3>

In [29]:
exam_df = pd.read_csv('Data/exam_review.csv')

In [30]:
exam_df.head()

                               first_name>last_name>age>math_score>french_score
Ray>Morley>18>"68     000">"75                                             000"
Melvin>Scott>24>77>83 NaN                                                   NaN
Amirah>Haley>22>92>67 NaN                                                   NaN
Gerard>Mills>19>"78   000">72                                               NaN
Amy>Grimes>23>91>81   NaN                                                   NaN

<h3>Custom data delimiters using sep parameter</h3>

In [32]:
exam_df = pd.read_csv('Data/exam_review.csv',
                    sep='>')
exam_df.head()

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

In [34]:
exam_df[['math_score','french_score']].dtypes

math_score      object
french_score    object
dtype: object

In [37]:
exam_df = pd.read_csv('Data/exam_review.csv',sep='>',decimal=',')
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

In [39]:
exam_df = pd.read_csv('Data/exam_review.csv',sep='>',thousands=',')
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18       68000         75000
1     Melvin     Scott   24          77            83
2     Amirah     Haley   22          92            67
3     Gerard     Mills   19       78000            72
4        Amy    Grimes   23          91            81

In [41]:
exam_df = pd.read_csv('Data/exam_review.csv',sep='>',skiprows=2)
exam_df

   Melvin   Scott  24      77  83
0  Amirah   Haley  22      92  67
1  Gerard   Mills  19  78,000  72
2     Amy  Grimes  23      91  81

In [42]:
exam_df = pd.read_csv('Data/exam_review.csv',sep='>',skiprows=[1,3])
exam_df

  first_name last_name  age math_score  french_score
0     Melvin     Scott   24         77            83
1     Gerard     Mills   19     78,000            72
2        Amy    Grimes   23         91            81

<h3>Get rid of blank lines(skip_blank_lines)</h3>

In [43]:
exam_df = pd.read_csv('Data/exam_review.csv',sep='>',skip_blank_lines=False)
exam_df

  first_name last_name   age math_score french_score
0        Ray    Morley  18.0     68,000       75,000
1     Melvin     Scott  24.0         77           83
2     Amirah     Haley  22.0         92           67
3        NaN       NaN   NaN        NaN          NaN
4     Gerard     Mills  19.0     78,000           72
5        Amy    Grimes  23.0         91           81

<h3>Loading specific columns(usecols)</h3>

In [44]:
exam_df = pd.read_csv('Data/exam_review.csv',sep='>',usecols=['first_name','last_name'])

In [45]:
exam_df

  first_name last_name
0        Ray    Morley
1     Melvin     Scott
2     Amirah     Haley
3     Gerard     Mills
4        Amy    Grimes

In [46]:
exam_df = pd.read_csv('Data/exam_review.csv',sep='>',usecols=[0,1,2])

In [47]:
exam_df

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

<h3>Using Series instead of Dataframes (squeeze)</h3>

In [51]:
exam_test_1 = pd.read_csv('Data/exam_review.csv',sep='>',usecols=['first_name'])

In [52]:
type(exam_test_1)

pandas.core.frame.DataFrame

In [53]:
exam_test_2 = pd.read_csv('Data/exam_review.csv',sep='>',usecols=['first_name'],squeeze=True)

In [54]:
type(exam_test_2)

pandas.core.series.Series

<h3>Save to CSV</h3>

In [55]:
exam_df

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

In [56]:
exam_df.to_csv()

',first_name,last_name,age\r\n0,Ray,Morley,18\r\n1,Melvin,Scott,24\r\n2,Amirah,Haley,22\r\n3,Gerard,Mills,19\r\n4,Amy,Grimes,23\r\n'

In [57]:
exam_df.to_csv('Data/out.csv')

In [61]:
pd.read_csv('Data/out.csv',index_col=[0])

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

In [62]:
exam_df.to_csv('Data/out.csv',index=None)

In [63]:
pd.read_csv('Data/out.csv')

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23